using System;
namespace dz
{
    class Program3
    {
        static void Main()
        {
            Console.WriteLine("Введите год:");
            int год = Convert.ToInt32(Console.ReadLine());
            Console.WriteLine("Введите номер дня года:");
            int день = Convert.ToInt32(Console.ReadLine());
            bool високосный = false;
            if (год % 400 == 0)
            {
                високосный = true;
            }
            else if (год % 100 == 0)
            {
                високосный = false;
            }
            else if (год % 4 == 0)
            {
                високосный = true;
            }
            int количествоДней = 365;
            if (високосный)
            {
                количествоДней = 366;
            }
            if (день < 1 || день > количествоДней)
            {
                Console.WriteLine("Ошибка! Неправильный номер дня.");
            }
            else
            {
                int[] дниВМесяцах =
                {
                    31, 28, 31, 30, 31, 30,
                    31, 31, 30, 31, 30, 31
                };
                string[] месяцы =
                {
                    "января", "февраля", "марта", "апреля",
                    "мая", "июня", "июля", "августа",
                    "сентября", "октября", "ноября", "декабря"
                };
                if (високосный)
                {
                    дниВМесяцах[1] = 29;
                }
                int месяц = 0;
                while (день > дниВМесяцах[месяц])
                {
                    день = день - дниВМесяцах[месяц];
                    месяц++;
                }
                Console.WriteLine("Дата: " + день + " " + месяцы[месяц]);
            }
        }
    }
}